Revit 2027 API
ParameterTypeId.IconIndexParam Property
 "Index Into Image File Name Array (for Use with XAML)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId IconIndexParam { get; }
Public Shared ReadOnly Property IconIndexParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ IconIndexParam {
	ForgeTypeId^ get ();
}
static member IconIndexParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace